mpiwowar1/ESP32DisplayApp/src/main.cpp
/*
 * ESP32 LED Matrix - Persistent Storage (AP Mode)
 * 
 * Features:
 * - Creates its own WiFi (LED_Matrix_64x64)
 * - Saves images/GIFs to flash storage (survives power off!)
 * - Auto-plays last content on boot
 * - Phone sends once, it stays forever
 * - Supports both static images and animated GIFs
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <SPIFFS.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <AnimatedGIF.h>
#include "esp_wifi.h"
#include "esp_log.h"


// ========== WIFI CONFIGURATION ==========
const char* ssid = "SetUPMatrix";
const char* password = "setuppassword123";


// ========== PIN CONFIGURATION ==========
#define R1_PIN 25
#define G1_PIN 26
#define B1_PIN 27
#define R2_PIN 14
#define G2_PIN 12
#define B2_PIN 13
#define A_PIN 19
#define B_PIN 18
#define C_PIN 5
#define D_PIN 17
#define E_PIN 16
#define LAT_PIN 22
#define OE_PIN 4
#define CLK_PIN 23
#define BUTTON_PIN 15


#define PANEL_WIDTH 64
#define PANEL_HEIGHT 64
#define CHAIN_LENGTH 1

// ========== STORAGE FILES ==========
#define STORED_FILE "/current.dat"   // Stores the actual image/GIF data
#define TYPE_FILE "/type.txt"         // Stores "image" or "gif"
#define STORED_WIFI "/cred.txt"
#define STORED_BRIGHTNESS "/brightness.txt"


// ========== GLOBAL OBJECTS ==========
MatrixPanel_I2S_DMA *dma_display = nullptr;
WebServer server(80);
AnimatedGIF gif;

String currentType = "none";
bool isPlayingGif = false;
uint8_t* gifData = nullptr;
size_t gifSize = 0;
uint8_t brightness = 90;
const unsigned long LONG_PRESS_TIME = 1200;  // ms




// ========== FUNCTION PROTOTYPES ==========
bool ConnectToStoredWiFi();
void setupWiFi();
void setupSPIFFS();
void setupWebServer();
void handleRoot();
void handleDelete();
void handleStatus();
void HandleWifi();
void loadAndDisplayStored();
void displayStoredImage();
void playStoredGif();
void GIFDraw(GIFDRAW *pDraw);
void displayBootAnimation();
void HandleLongButtonPress();
void HandleShortButtonPress();
void PostBrightness();
void GetBrightness();
uint8_t ReadBrightness();


void WiFiEvent(WiFiEvent_t event) {
  Serial.printf("[WiFi-event] %d\n", event);

  switch(event) {
    case SYSTEM_EVENT_AP_START:
      Serial.println("AP Started");
      break;

    case SYSTEM_EVENT_AP_STACONNECTED:
      Serial.println("Client connected (auth OK)");
      break;

    case SYSTEM_EVENT_AP_STADISCONNECTED:
      Serial.println("Client disconnected");
      break;

    case SYSTEM_EVENT_AP_STAIPASSIGNED:
      Serial.println("IP assigned to client");
      break;

    default:
      break;
  }
}


// ========== SETUP ==========
void setup() {
  Serial.begin(115200);

  delay(500);

  esp_log_level_set("wifi", ESP_LOG_VERBOSE);
  esp_log_level_set("dhcps", ESP_LOG_VERBOSE);
  
  WiFi.onEvent(WiFiEvent);



  Serial.println("\n\n=====================================");
  Serial.println("LED Matrix - Persistent Storage");
  Serial.println("=====================================\n");

  // Initialize SPIFFS (flash storage)
  setupSPIFFS();

  //Setting Up button
  pinMode(BUTTON_PIN, INPUT_PULLUP);  // internal pull-up


  // Configure matrix
  HUB75_I2S_CFG mxconfig(PANEL_WIDTH, PANEL_HEIGHT, CHAIN_LENGTH);
  mxconfig.gpio.r1 = R1_PIN;
  mxconfig.gpio.g1 = G1_PIN;
  mxconfig.gpio.b1 = B1_PIN;
  mxconfig.gpio.r2 = R2_PIN;
  mxconfig.gpio.g2 = G2_PIN;
  mxconfig.gpio.b2 = B2_PIN;
  mxconfig.gpio.a = A_PIN;
  mxconfig.gpio.b = B_PIN;
  mxconfig.gpio.c = C_PIN;
  mxconfig.gpio.d = D_PIN;
  mxconfig.gpio.e = E_PIN;
  mxconfig.gpio.lat = LAT_PIN;
  mxconfig.gpio.oe = OE_PIN;
  mxconfig.gpio.clk = CLK_PIN;

  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  dma_display->begin();
  brightness = ReadBrightness();
  dma_display->setBrightness8(brightness);
  dma_display->clearScreen();

  Serial.println("✓ Matrix initialized");

  // Show boot animation
  displayBootAnimation();


  isPlayingGif = false;
  gif.close();

  dma_display->clearScreen();
  delay(200);


  if (ConnectToStoredWiFi()) {
      setupWebServer();
  }


  dma_display->clearScreen();
  dma_display->setTextColor(dma_display->color565(0, 255, 0));
  dma_display->setTextSize(1);
  dma_display->setCursor(2, 2);
  if(WiFi.status() != WL_CONNECTED){
    dma_display->print("WIFI NOT");
  }
  else{
    dma_display->print("WIFI");
  }
  dma_display->setCursor(2, 12);
  dma_display->print("CONNECTED");
  delay(2000);
  // Load and display stored content (if any)
  dma_display->clearScreen();
  loadAndDisplayStored();

  Serial.println("\n=====================================");
  Serial.println("Ready! Content persists after power off");
  Serial.println("=====================================\n");
}

// ========== MAIN LOOP ==========
void loop() {
  server.handleClient();


  static bool lastButtonState = HIGH;
  static bool buttonPressed = false;
  static unsigned long pressStartTime = 0;
  static bool longPressHandled = false;

  bool currentState = digitalRead(BUTTON_PIN);

  // Button just pressed
  if (lastButtonState == HIGH && currentState == LOW) {
    buttonPressed = true;
    pressStartTime = millis();
    longPressHandled = false;
  }

  // Button held down
  if (buttonPressed && currentState == LOW) {
    if (!longPressHandled &&
        millis() - pressStartTime >= LONG_PRESS_TIME) {
      longPressHandled = true;
      HandleLongButtonPress();
    }
  }

  // Button released
  if (lastButtonState == LOW && currentState == HIGH) {
    if (buttonPressed && !longPressHandled) {
      HandleShortButtonPress();
    }
    buttonPressed = false;
  }

  lastButtonState = currentState;


  if (isPlayingGif && gifData != nullptr) {
    gif.playFrame(true, nullptr);
  }

  delay(1);
}


// =========SETTING BRIGHTNESS =========
void PostBrightness() {
    Serial.println("PostBrightness called!");

    if (!server.hasArg("brightness")) {
        server.send(400, "text/plain", "Missing brightness");
        return;
    }

    String brightnesssave = server.arg("brightness");
    brightnesssave.trim();
    brightness = (uint8_t)brightnesssave.toInt();

    Serial.printf("Saving brightness: %d\n", brightness);

    File file = SPIFFS.open("/brightness.txt", FILE_WRITE);  // ✅ leading slash
    if (!file) {
        Serial.println("Failed to open /brightness.txt for writing");
        server.send(500, "text/plain", "Failed to open file for writing");
        return;
    }

    file.print("brightness=");
    file.println(brightness);
    file.close();  // ✅ always close!

    Serial.println("Brightness saved successfully");
    server.send(200, "text/plain", "Brightness stored successfully");

    dma_display->setBrightness8(brightness);  // ✅ apply directly, no need to re-read
}

// =========GETTING BRIGHTNESS =========
void GetBrightness()
{
  String tempbrightness = "{";
  tempbrightness += "\"brightness\":\"" + String(brightness) + "\"}";
  
  server.send(200, "application/json", tempbrightness);
}




// ======Handling button press(SETUP MODE) ===========
void HandleLongButtonPress() {
  Serial.println("Button pressed: entering SETUP mode");
  dma_display->clearScreen();
  dma_display->setTextColor(dma_display->color565(0, 255, 0));
  dma_display->setTextSize(1);
  dma_display->setCursor(2, 2);
  dma_display->print("STARTING");
  dma_display->setCursor(2, 12);
  dma_display->print("SETUP MODE");

  // Wait for button release before proceeding
  delay(50);
  while (digitalRead(BUTTON_PIN) == LOW) { delay(10); }
  delay(50);

  server.stop();
  WiFi.softAPdisconnect(true);
  WiFi.disconnect(true, true);
  WiFi.mode(WIFI_OFF);
  delay(1000);


  isPlayingGif = false;
  gif.close();

  dma_display->clearScreen();
  delay(200);


  setupWiFi();
  setupWebServer();

  // Draw SETUP MODE indicator after setupWiFi() is done
  dma_display->clearScreen();
  dma_display->setTextColor(dma_display->color565(0, 255, 0));
  dma_display->setTextSize(1);
  dma_display->setCursor(2, 2);
  dma_display->print("SETUP MODE");
  dma_display->setCursor(2, 12);
  dma_display->print(WiFi.softAPSSID());
  dma_display->setCursor(7, 22);
  dma_display->print(WiFi.softAPIP().toString());
  dma_display->setCursor(16, 32);
  dma_display->print("Hold to erase Memory");

