mpiwowar1/ESP32DisplayApp/src/main.cpp
  Serial.println("SETUP mode active. Press button again to exit.");

  // Serve clients until button is pressed again
      bool lastButtonState  = HIGH;   // NOT static
    bool buttonPressed    = false;
    unsigned long pressStartTime = 0;
    bool longPressHandled = false;
  while (true) {
    server.handleClient();
    delay(1);

  bool currentState = digitalRead(BUTTON_PIN);

  // Button just pressed
  if (lastButtonState == HIGH && currentState == LOW) {
    buttonPressed = true;
    pressStartTime = millis();
    longPressHandled = false;
  }

  // Button held down
  if (buttonPressed && currentState == LOW) {
    if (!longPressHandled &&
        millis() - pressStartTime >= LONG_PRESS_TIME) {
      longPressHandled = true;
      dma_display->clearScreen();
      dma_display->setTextColor(dma_display->color565(0, 255, 0));
      dma_display->setTextSize(1);
      dma_display->setCursor(2, 2);
      dma_display->print("FORMATING...");
      SPIFFS.format();
      dma_display->clearScreen();
      dma_display->setTextColor(dma_display->color565(0, 255, 0));
      dma_display->setTextSize(1);
      dma_display->setCursor(2, 2);
      dma_display->print("MEMORY(SPIFFS)");
      dma_display->setCursor(2, 12);
      dma_display->print("FORMATED");
      delay(2000);


      dma_display->clearScreen();
      dma_display->setTextColor(dma_display->color565(0, 255, 0));
      dma_display->setTextSize(1);
      dma_display->setCursor(2, 2);
      dma_display->print("SETUP MODE");
      dma_display->setCursor(2, 12);
      dma_display->print(WiFi.softAPSSID());
      dma_display->setCursor(7, 22);
      dma_display->print(WiFi.softAPIP().toString());
      dma_display->setCursor(16, 32);
      dma_display->print("Hold to erase Memory");

    }
  }

  // Button released
  if (lastButtonState == LOW && currentState == HIGH) {
    if (buttonPressed && !longPressHandled) {
      break;
    }
    buttonPressed = false;
  }

  lastButtonState = currentState;

  }

  Serial.println("Exiting SETUP mode...");
  dma_display->clearScreen();
  dma_display->setTextColor(dma_display->color565(0, 255, 0));
  dma_display->setTextSize(1);
  dma_display->setCursor(2, 2);
  dma_display->print("EXITING &");
  dma_display->setCursor(2, 12);
  dma_display->print("CONNECTING");
  dma_display->setCursor(2, 22);
  dma_display->print("TO WIFI");

  server.stop();
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(500);

  if (ConnectToStoredWiFi()) {
    setupWebServer();
    Serial.println("STA mode restored.");
    dma_display->clearScreen();
    dma_display->setTextColor(dma_display->color565(0, 255, 0));
    dma_display->setTextSize(1);
    dma_display->setCursor(2, 2);
    dma_display->print("CONNECTED");
  } else {
    Serial.println("Could not connect — check saved credentials.");
    dma_display->clearScreen();
    dma_display->setTextColor(dma_display->color565(255, 0, 0));
    dma_display->setTextSize(1);
    dma_display->setCursor(2, 2);
    dma_display->print("WiFi FAIL");
    dma_display->setCursor(2, 14);
    dma_display->print("Check cred");
  }
  delay(2000);
  dma_display->clearScreen();
  loadAndDisplayStored();
}
// ========= RECONNECT WIFI IF NOT CONNECTED PLUS INFO ===========
void HandleShortButtonPress(){
  dma_display->clearScreen();
  dma_display->setTextColor(dma_display->color565(255, 0, 0));
  dma_display->setTextSize(1);
  dma_display->setCursor(2, 2);
  dma_display->print("WiFi CheckUp");

  if(WiFi.status() != WL_CONNECTED){
  server.stop();
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(500);

  if (ConnectToStoredWiFi()) {
    setupWebServer();
    Serial.println("STA mode connected");
  } else {
    Serial.println("Could not connect");
    dma_display->clearScreen();
    dma_display->setTextColor(dma_display->color565(255, 0, 0));
    dma_display->setTextSize(1);
    dma_display->setCursor(2, 2);
    dma_display->print("WiFi FAILED");
  }
}
if(WiFi.status() == WL_CONNECTED){
    dma_display->clearScreen();
    dma_display->setTextColor(dma_display->color565(255, 0, 0));
    dma_display->setTextSize(1);
    dma_display->setCursor(2, 2);
    dma_display->print("Connected");
    dma_display->setCursor(2, 12);
    dma_display->print(WiFi.SSID());
    dma_display->setCursor(2, 22);
    dma_display->print(WiFi.localIP().toString());
}

while (true) {
  server.handleClient();
  delay(1);

  if (digitalRead(BUTTON_PIN) == LOW) {
    delay(50);
    if (digitalRead(BUTTON_PIN) == LOW) {
      while (digitalRead(BUTTON_PIN) == LOW) { delay(10); }
      delay(50);
      break;
    }
  }
}
dma_display->clearScreen();
loadAndDisplayStored();

}



// ========== SPIFFS SETUP ==========
void setupSPIFFS() {
  Serial.println("Initializing flash storage (SPIFFS)...");
  
  if (!SPIFFS.begin(true)) {
    Serial.println("✗ SPIFFS mount failed!");
    return;
  }

  Serial.println("✓ SPIFFS mounted");
  
  // Show storage info
  size_t totalBytes = SPIFFS.totalBytes();
  size_t usedBytes = SPIFFS.usedBytes();
  Serial.printf("  Total: %d bytes\n", totalBytes);
  Serial.printf("  Used: %d bytes\n", usedBytes);
  Serial.printf("  Free: %d bytes\n", totalBytes - usedBytes);
}

// ====== CONNECT TO WIFI ======
bool ConnectToStoredWiFi() {
  if (!SPIFFS.exists("/wifi.txt")) {
    Serial.println("Brak zapisanych danych WiFi");
    return false;
  }

  File file = SPIFFS.open("/wifi.txt", "r");
  if (!file) {
    Serial.println("Nie mozna otworzyc pliku WiFi");
    return false;
  }

  String ssidLine = file.readStringUntil('\n');
  String passLine = file.readStringUntil('\n');
  file.close();

  ssidLine.trim();
  passLine.trim();

  if (!ssidLine.startsWith("ssid=") || !passLine.startsWith("password=")) {
    Serial.println("Nieprawidlowy format pliku WiFi");
    return false;
  }

  String ssid = ssidLine.substring(5);
  String password = passLine.substring(9);

  Serial.print("Laczenie z WiFi:");
  Serial.println(ssid);
  Serial.print(";");
  Serial.println(password);

  WiFi.disconnect(true, true);
  delay(300);

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);     // VERY important
  delay(300);

  WiFi.begin(ssid.c_str(), password.c_str());

  unsigned long startAttemptTime = millis();

  while (WiFi.status() != WL_CONNECTED &&
         millis() - startAttemptTime < 15000) {
    delay(500);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nPolaczono z WiFi!");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    return true;
  } else {
    WiFi.disconnect(true, true);
    WiFi.mode(WIFI_OFF);           
    delay(200);
    Serial.println("\nNie udalo sie polaczyc z WiFi");
    return false;
  }
}


// ========== WIFI SETUP ==========
void setupWiFi() {
  Serial.println("Setting up WiFi Access Point...");

  isPlayingGif = false;
  gif.close();
  dma_display->clearScreen();
  delay(300);
  // FULL reset of WiFi stack
  WiFi.softAPdisconnect(true);
  WiFi.disconnect(true, true);  // erase old config
  WiFi.mode(WIFI_OFF);
  delay(1000);

  WiFi.mode(WIFI_AP);
  WiFi.setSleep(false);   // CRITICAL

  bool result = WiFi.softAP(ssid);

  if (!result) {
    Serial.println("AP failed to start!");
    return;
  }

  delay(5000);  // Give DHCP time to stabilize

  Serial.print("AP IP: ");
  Serial.println(WiFi.softAPIP());
}



// ========== WEB SERVER SETUP ==========
void setupWebServer() {
  server.on("/", HTTP_GET, handleRoot);
  server.on("/status", HTTP_GET, handleStatus);
  server.on("/delete", HTTP_POST, handleDelete);
  server.on("/cred",HTTP_POST,HandleWifi);
  server.on("/postbrightness",HTTP_POST,PostBrightness);
  server.on("/getbrightness",HTTP_GET,GetBrightness);

  // Handle upload with proper body parsing
  server.on("/upload", HTTP_POST, 
    []() {
      // This is called after upload completes
      server.send(200, "text/plain", "Saved! Will persist after power off");
    },
    []() {
      // This is called during upload for each chunk
      HTTPUpload& upload = server.upload();
      static File uploadFile;
      static size_t totalSize = 0;
      static bool isFirstChunk = true;
      
