mpiwowar1/ESP32DisplayApp/src/main.cpp
      if (upload.status == UPLOAD_FILE_START) {
        Serial.printf("\n📥 Upload starting: %s\n", upload.filename.c_str());
        totalSize = 0;
        isFirstChunk = true;
        
        // Open file for writing
        uploadFile = SPIFFS.open(STORED_FILE, "w");
        if (!uploadFile) {
          Serial.println("✗ Failed to open file for writing");
        }
      }
      else if (upload.status == UPLOAD_FILE_WRITE) {
        if (uploadFile) {
          // Write chunk to file
          uploadFile.write(upload.buf, upload.currentSize);
          totalSize += upload.currentSize;
          
          if (isFirstChunk) {
            // Check file type from first chunk
            if (upload.buf[0] == 'G' && upload.buf[1] == 'I' && upload.buf[2] == 'F') {
              Serial.println("Type: Animated GIF");
              File typeFile = SPIFFS.open(TYPE_FILE, "w");
              if (typeFile) {
                typeFile.print("gif");
                typeFile.close();
              }
              currentType = "gif";
            } else {
              Serial.println("Type: Static image");
              File typeFile = SPIFFS.open(TYPE_FILE, "w");
              if (typeFile) {
                typeFile.print("image");
                typeFile.close();
              }
              currentType = "image";
            }
            isFirstChunk = false;
          }
          
          Serial.printf("  Received: %d bytes (total: %d)\n", upload.currentSize, totalSize);
        }
      }
      else if (upload.status == UPLOAD_FILE_END) {
        if (uploadFile) {
          uploadFile.close();
          Serial.printf("✓ Upload complete: %d bytes\n", totalSize);
          Serial.println("✓ Saved to flash storage");
          
          // Display immediately
          dma_display->clearScreen();
          loadAndDisplayStored();
          Serial.println("✓ Content stored permanently!\n");
        }
      }
    }
  );
  
  server.begin();
  Serial.println("✓ Web server started");
}

// ========== WEB PAGE ==========
const char HTML_PAGE[] PROGMEM = 
"<!DOCTYPE html><html><head><meta charset='UTF-8'>"
"<meta name='viewport' content='width=device-width,initial-scale=1'>"
"<title>LED Matrix</title><style>"
"body{font-family:Arial;background:#667eea;color:#fff;padding:20px;margin:0;text-align:center}"
".box{max-width:500px;margin:0 auto;background:rgba(255,255,255,0.1);padding:20px;border-radius:10px}"
"h1{margin:0 0 20px}"
".info{background:rgba(0,0,0,0.2);padding:15px;border-radius:8px;margin:15px 0;font-size:14px}"
".highlight{background:rgba(76,175,80,0.3);padding:10px;border-radius:5px;margin:10px 0}"
"code{background:rgba(0,0,0,0.3);padding:2px 6px;border-radius:3px}"
".btn{background:#764ba2;color:#fff;border:none;padding:12px 20px;border-radius:8px;margin:5px;cursor:pointer}"
".btn:hover{background:#8b5cb8}"
"</style></head><body><div class='box'>"
"<h1>LED Matrix 64x64</h1>"
"<div class='highlight'><strong>✓ Content persists after power off!</strong></div>"
"<div class='info'><strong>How to use:</strong><br>"
"1. Connect to this WiFi once<br>"
"2. Send image or GIF from your app<br>"
"3. It stays forever (even after unplugging!)<br>"
"4. Disconnect and enjoy<br></div>"
"<div class='info'><strong>API Endpoints:</strong><br>"
"POST <code>/upload</code> - Send image/GIF<br>"
"POST <code>/delete</code> - Clear display<br>"
"GET <code>/status</code> - Check what's stored<br></div>"
"<div class='info'><strong>Data formats:</strong><br>"
"• Images: RGB565 (8192 bytes) or RGB888 (12288 bytes)<br>"
"• GIFs: Standard GIF file (max ~100KB)<br></div>"
"<button class='btn' onclick='location.reload()'>Refresh</button>"
"<button class='btn' onclick='clearDisplay()'>Clear Display</button>"
"<script>function clearDisplay(){fetch('/delete',{method:'POST'}).then(()=>alert('Display cleared!'))}</script>"
"</div></body></html>";

void handleRoot() {
  server.send_P(200, "text/html", HTML_PAGE);
}

// ========== HANDLE DELETE ==========
void handleDelete() {
  if (SPIFFS.exists(STORED_FILE)) {
    SPIFFS.remove(STORED_FILE);
  }
  if (SPIFFS.exists(TYPE_FILE)) {
    SPIFFS.remove(TYPE_FILE);
  }

  isPlayingGif = false;
  if (gifData) {
    free(gifData);
    gifData = nullptr;
  }

  dma_display->clearScreen();
  currentType = "none";

  server.send(200, "text/plain", "Cleared");
  Serial.println("🗑️ Storage cleared");
}

// ========== HANDLE STATUS ==========
void handleStatus() {
  String status = "{";
  status += "\"type\":\"" + currentType + "\",";
  status += "\"stored\":" + String(SPIFFS.exists(STORED_FILE) ? "true" : "false") + ",";
  
  if (SPIFFS.exists(STORED_FILE)) {
    File file = SPIFFS.open(STORED_FILE, "r");
    if (file) {
      status += "\"size\":" + String(file.size()) + ",";
      file.close();
    }
  }
  
  status += "\"storage_used\":" + String(SPIFFS.usedBytes()) + ",";
  status += "\"storage_total\":" + String(SPIFFS.totalBytes());
  status += "}";
  
  server.send(200, "application/json", status);
}

// ========== HANDLE CHANGING WIFI CREDENTIALS ==========

void HandleWifi() {
    Serial.println("HandleWifi called!");

    if (!server.hasArg("ssid") || !server.hasArg("password")) {
        Serial.println("Missing SSID or password");
        server.send(400, "text/plain", "Missing SSID or password");
        return;
    }

    // Copy strings properly
    String ssidcred = server.arg("ssid");
    String passwordcred = server.arg("password");
    ssidcred.trim();
    passwordcred.trim();

    Serial.printf("Saving SSID: '%s', Password: '%s'\n", ssidcred.c_str(), passwordcred.c_str());

    // Open file in write mode (overwrites existing)
    File file = SPIFFS.open("/wifi.txt", FILE_WRITE);
    if (!file) {
        Serial.println("Failed to open /wifi.txt for writing");
        server.send(500, "text/plain", "Failed to open file for writing");
        return;
    }

    file.print("ssid=");
    file.println(ssidcred);
    file.print("password=");
    file.println(passwordcred);
    file.close();

