mpiwowar1/ESP32DisplayApp/src/main.cpp
    Serial.println("WiFi credentials saved successfully");
    server.send(200, "text/plain", "WiFi credentials stored successfully");
}



// ========== LOAD AND DISPLAY STORED CONTENT ==========
void loadAndDisplayStored() {
  // Check if type file exists
  if (!SPIFFS.exists(TYPE_FILE)) {
    Serial.println("No stored content found");
    return;
  }

  // Read type
  File typeFile = SPIFFS.open(TYPE_FILE, "r");
  if (typeFile) {
    currentType = typeFile.readString();
    currentType.trim();
    typeFile.close();
    Serial.printf("Found stored content: %s\n", currentType.c_str());
  }

  // Load and display based on type
  if (currentType == "image") {
    displayStoredImage();
  } else if (currentType == "gif") {
    playStoredGif();
  }
}

// ========== DISPLAY STORED IMAGE ==========
void displayStoredImage() {
  if (!SPIFFS.exists(STORED_FILE)) {
    Serial.println("No image file found");
    return;
  }

  File file = SPIFFS.open(STORED_FILE, "r");
  if (!file) {
    Serial.println("Failed to open image file");
    return;
  }

  size_t size = file.size();
  Serial.printf("Loading image: %d bytes\n", size);

  dma_display->clearScreen();

  if (size == 8192) {
    // RGB565 format
    for (int y = 0; y < 64; y++) {
      for (int x = 0; x < 64; x++) {
        uint8_t byte1 = file.read();
        uint8_t byte2 = file.read();
        uint16_t color = (byte1 << 8) | byte2;
        dma_display->drawPixel(x, y, color);
      }
    }
  } else if (size == 12288) {
    // RGB888 format
    for (int y = 0; y < 64; y++) {
      for (int x = 0; x < 64; x++) {
        uint8_t r = file.read();
        uint8_t g = file.read();
        uint8_t b = file.read();
        dma_display->drawPixelRGB888(x, y, r, g, b);
      }
    }
  }

  file.close();
  Serial.println("✓ Image displayed from storage");
}

// ========== PLAY STORED GIF ==========
void playStoredGif() {
  if (!SPIFFS.exists(STORED_FILE)) {
    Serial.println("No GIF file found");
    return;
  }

  File file = SPIFFS.open(STORED_FILE, "r");
  if (!file) {
    Serial.println("Failed to open GIF file");
    return;
  }

  gifSize = file.size();
  Serial.printf("Loading GIF: %d bytes\n", gifSize);

  // Free previous GIF data
  if (gifData) {
    free(gifData);
  }

  // Allocate memory for GIF
  gifData = (uint8_t*)malloc(gifSize);
  if (!gifData) {
    Serial.println("Failed to allocate memory for GIF");
    file.close();
    return;
  }

  // Read GIF into memory
  file.read(gifData, gifSize);
  file.close();

  // Open and play GIF
  if (gif.open(gifData, gifSize, GIFDraw)) {
    Serial.println("✓ GIF playing from storage");
    isPlayingGif = true;
  } else {
    Serial.println("Failed to open GIF");
    free(gifData);
    gifData = nullptr;
  }
}

// ========== GIF DRAW CALLBACK ==========
void GIFDraw(GIFDRAW *pDraw) {
  uint8_t *s;
  uint16_t *d, *usPalette;
  int x, y;

  usPalette = pDraw->pPalette;
  y = pDraw->iY + pDraw->y;
  
  if (y >= PANEL_HEIGHT || pDraw->iX >= PANEL_WIDTH) 
    return;
    
  s = pDraw->pPixels;
  
  if (pDraw->ucDisposalMethod == 2) {
    for (x = 0; x < pDraw->iWidth; x++) {
      if (s[x] == pDraw->ucTransparent) {
        s[x] = pDraw->ucBackground;
      }
    }
    pDraw->ucHasTransparency = 0;
  }
  
  if (pDraw->ucHasTransparency) {
    uint8_t c, ucTransparent = pDraw->ucTransparent;
    for (x = 0; x < pDraw->iWidth; x++) {
      c = s[x];
      if (c != ucTransparent) {
        uint16_t color = usPalette[c];
        int px = pDraw->iX + x;
        if (px < PANEL_WIDTH && y < PANEL_HEIGHT) {
          dma_display->drawPixel(px, y, color);
        }
      }
    }
  } else {
    for (x = 0; x < pDraw->iWidth; x++) {
      uint16_t color = usPalette[s[x]];
      int px = pDraw->iX + x;
      if (px < PANEL_WIDTH && y < PANEL_HEIGHT) {
        dma_display->drawPixel(px, y, color);
      }
    }
  }
}

// ==============READING BRIGHTNESS FROM FILE ==============
uint8_t ReadBrightness()
{
  if (!SPIFFS.exists(STORED_BRIGHTNESS)) {
    Serial.println("Brightness not saved defaulting to 90");
    return 90;
  }

  File file = SPIFFS.open(STORED_BRIGHTNESS, "r");
  if (!file) {
    Serial.println("Brightness file cannot be opened");
    return 90;
  }

  String brightnessread = file.readStringUntil('\n');
  file.close();

  brightnessread.trim();

  if (!brightnessread.startsWith("brightness=")) {
    Serial.println("Faulty brightness file");
    return 90;
  }

  brightnessread = brightnessread.substring(11);


  uint8_t tempbrightness = brightnessread.toInt();

  Serial.print("Returning brightness: ");
  Serial.println(brightnessread);
  return tempbrightness;
}


// ========== BOOT ANIMATION ==========
void displayBootAnimation() {
  Serial.println("Boot animation...");
  
  for (int frame = 0; frame < 20; frame++) {
    for (int x = 0; x < 64; x++) {
      for (int y = 0; y < 64; y++) {
        float distance = sqrt(pow(x - 32, 2) + pow(y - 32, 2));
        uint8_t r = (uint8_t)(128 + 127 * sin(distance * 0.2 - frame * 0.3));
        uint8_t g = (uint8_t)(128 + 127 * sin(distance * 0.2 - frame * 0.3 + 2.0));
        uint8_t b = (uint8_t)(128 + 127 * sin(distance * 0.2 - frame * 0.3 + 4.0));
        dma_display->drawPixelRGB888(x, y, r, g, b);
      }
    }
    delay(30);
  }
  
  dma_display->clearScreen();
}